tap "azure/functions"
tap "brandonskerritt/rustscan"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "ack"
brew "ansible"
brew "python@3.8"
brew "azure-cli"
brew "bat"
brew "docker", link: false
brew "exercism"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "highlight"
brew "hub"
brew "inetutils"
brew "jq"
brew "kubernetes-cli"
brew "lnav"
brew "markdown"
brew "neovim"
brew "nmap"
brew "node"
brew "nvm"
brew "pkcs11-helper"
brew "openvpn"
brew "packer"
brew "pandoc"
brew "reattach-to-user-namespace"
brew "rust"
brew "shellcheck"
brew "terraform"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "wget"
brew "z"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "azure/functions/azure-functions-core-tools@3"
brew "brandonskerritt/rustscan/rustscan"
cask "1password"
cask "alfred"
cask "discord"
cask "docker"
cask "drawio"
cask "figma"
cask "font-dejavusansmono-nerd-font"
cask "font-hack-nerd-font"
cask "gpg-suite-no-mail"
cask "handbrake"
cask "insomnia"
cask "iterm2"
cask "logos"
cask "menumeters"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-teams"
cask "obs"
cask "owasp-zap"
cask "postman"
cask "powershell"
cask "private-internet-access"
cask "signal"
cask "spotify"
cask "steam"
cask "unetbootin"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vmware-fusion"
cask "wireshark"
cask "flux"
