tap "1password/tap"
tap "anchore/grype"
tap "anchore/syft"
tap "aquasecurity/trivy"
tap "azure/functions"
tap "brandonskerritt/rustscan"
tap "caffix/amass"
tap "dapr/tap"
tap "dart-lang/dart"
tap "fsouza/prettierd"
tap "gitguardian/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "majd/repo"
tap "noahgorstein/tap"
tap "oven-sh/bun"
tap "planetscale/tap"
tap "rcmdnk/file"
# Search tool like grep, but optimized for programmers
brew "ack"
# Run your GitHub Actions locally
brew "act"
# C Foreign Function Interface for Python
brew "cffi"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Platform built on V8 to build network applications
brew "node"
# Allows you to programmatically authenticate into AWS accounts through IAM roles
brew "aws-auth"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Debugger for the Go programming language
brew "delve"
# Tool for exploring each layer in a docker image
brew "dive"
# Text processing system for reStructuredText
brew "docutils"
# .NET Core
brew "dotnet@6"
# Modern replacement for 'ls'
brew "exa"
# Command-line tool to interact with exercism.io
brew "exercism"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fast, simple, recursive content discovery tool written in Rust
brew "feroxbuster"
# Fast web fuzzer written in Go
brew "ffuf"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Render markdown on the CLI
brew "glow"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Directory/file & DNS busting tool written in Go
brew "gobuster"
# GNU grep, egrep and fgrep
brew "grep"
# Vulnerability scanner for container images and filesystems
brew "grype"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Kubernetes package manager
brew "helm"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Open source relational database management system
brew "mysql-client"
# Network logon cracker which supports many services
brew "hydra"
# Command-line benchmarking tool
brew "hyperfine"
# Get events and tasks from the macOS calendar database
brew "ical-buddy"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# Tool for managing apps on iOS devices
brew "ideviceinstaller"
# GNU utilities for networking
brew "inetutils"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Featureful UNIX password cracker
brew "john"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Simple terminal UI for git commands
brew "lazygit"
# Multi-format archive and compression library
brew "libarchive"
# Linux virtual machines
brew "lima"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Text-to-HTML conversion tool
brew "markdown"
# Mac App Store command-line interface
brew "mas"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Web server scanner
brew "nikto"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Library to simplify the interaction with PKCS#11
brew "pkcs11-helper"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Fast, disk space efficient package manager
brew "pnpm"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Cloud native development platform
brew "pulumi"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Tool Command Language
brew "tcl-tk"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Modern Day Portscanner
brew "rustscan"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# Use SQL to instantly query your cloud services
brew "steampipe"
# CLI for generating a Software Bill of Materials from container images
brew "syft"
# Tool to build, change, and version infrastructure
brew "terraform"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Language Server Protocol for Terraform
brew "terraform-lsp"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Linter for Terraform files
brew "tflint"
# Static analysis security scanner for your terraform code
brew "tfsec"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Language Server for Yaml Files
brew "yaml-language-server"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Tracks most-used directories to make cd smarter
brew "z"
# Next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Scanner for vulnerabilities in container images, file systems, and Git repositories, as well as for configuration issues
brew "aquasecurity/trivy/trivy"
# Azure Functions Core Tools 3.0
brew "azure/functions/azure-functions-core-tools@3"
# Azure Functions Core Tools 4.0
brew "azure/functions/azure-functions-core-tools@4"
# In-depth Attack Surface Mapping and Asset Discovery
brew "caffix/amass/amass"
# Client for Dapr.
brew "dapr/tap/dapr-cli"
# SDK
brew "dart-lang/dart/dart"
# prettier, on SPEED!
brew "fsouza/prettierd/prettierd"
# Detect secrets in source code, scan your repos and docker images for leaks
brew "gitguardian/tap/ggshield"
# Vault
brew "hashicorp/tap/vault"
# a TUI playground to experiment and play with jq
brew "noahgorstein/tap/jqp"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# The PlanetScale CLI
brew "planetscale/tap/pscale"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Application launcher and productivity software
cask "alfred"
# Toolset to implement parts of Android apps in native code
cask "android-ndk"
# Android SDK component
cask "android-platform-tools"
# Chromium based browser
cask "arc"
# Data management tool that enables working with SQL Server
cask "azure-data-studio"
# Virtual Audio Driver
cask "blackhole-2ch"
# Web browser focusing on privacy
cask "brave-browser"
# Web security testing toolkit
cask "burp-suite-professional"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Utilities designed to make common development tasks easier
cask "devtoys"
# Voice and text chat software
cask "discord"
# Developer platform
cask "dotnet"
# Online diagram software
cask "drawio"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Monospaced font that includes programming ligatures
cask "font-cascadia-code"
# Developer targeted fonts with a high number of glyphs
cask "font-caskaydia-cove-nerd-font"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
cask "google-chat"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Client for the Google Drive storage service
cask "google-drive"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Open-source video transcoder
cask "handbrake"
# Utility to hide menu bar items
cask "hiddenbar"
# CLI tool for searching and downloading iOS app packages from the App Store
cask "ipatool"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Keyboard customiser
cask "karabiner-elements"
# Open-source keystroke visualiser
cask "keycastr"
# Noise cancelling application
cask "krisp"
# Bible study software
cask "logos"
# Trims video and audio files losslessly
cask "losslesscut"
# Set of CPU, memory, disk, and network monitoring tools
cask "menumeters"
# Penetration testing framework
cask "metasploit"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Command-line shell and scripting language
cask "powershell"
# VPN client
cask "private-internet-access"
# Kubernetes and container management on the desktop
cask "rancher"
# Control your tools with a few keystrokes
cask "raycast"
# GUI for streamlined Redis application development
cask "redisinsight"
# Instant messaging application focusing on security
cask "signal"
# Digital design and prototyping platform
cask "sketch"
# API testing tool
cask "soapui"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Messaging app with a focus on speed and security
cask "telegram"
# To-do list
cask "todoist"
# Open-source BitTorrent client
cask "transmission"
# Tool to install Linux/BSD distributions to a partition or USB drive
cask "unetbootin"
# Development environment
cask "vagrant"
# Multimedia player
cask "vlc"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Wine wrapper built with SwiftUI
cask "whisky"
# Network protocol analyzer
cask "wireshark"
# Free and open source web app scanner
cask "zap"
# Video communication and virtual meeting platform
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Final Cut Pro", id: 424389933
mas "GarageBand", id: 682658836
mas "Goodnotes", id: 1444383602
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Microsoft Remote Desktop", id: 1295203466
mas "Moom", id: 419330170
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pluralsight", id: 431748264
mas "ScreenBrush", id: 1233965871
mas "Slack", id: 803453959
mas "Spark Desktop", id: 6445813049
mas "Wallpapers HD Lite", id: 441812880
mas "Xcode", id: 497799835
